config/cf/Catalogs/Комиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Комиссии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияРасформирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписаниеПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияФункционируетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодписиКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтоПодписьПредседателяКомиссии</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодписьЧленаКомиссии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подписи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Catalogs/Комиссии/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	Если НЕ ЗначениеЗаполнено(Объект.ДатаПодписаниеПриказа) Тогда
		
		Объект.ДатаПодписаниеПриказа = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
	// Учет остатков контрагентов.
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("Организация");
	УправлениеITОтделом8УФ.УстановитьОграничениеТипаДляЭлементовФормы(ЭтаФорма, МассивЭлементов); 
	
	УправлениеДоступностью();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьДублиФизическихЛиц(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") 
		И ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаВыбораОрганизацииКонтрагента"
		И ИсточникВыбора.ВладелецФормы = ЭтаФорма Тогда
		УправлениеITОтделом8УФКлиент.ВыполнитьОбработчикОбработкаВыбораФормы(ЭтаФорма, 
		 				"Организация",
						Объект.Организация,
						ВыбранноеЗначение,
						Новый ОписаниеОповещения("ПослеОбработкиВыбора", ЭтотОбъект));	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодписиКомиссииЭтоПодписьПредседателяКомиссииПриИзменении(Элемент)
	
	ДанныеТекущейСтроки = Элементы.ПодписиКомиссии.ТекущиеДанные;
	Для каждого СтрокаТаблицы Из Объект.ПодписиКомиссии Цикл
		
		Если СтрокаТаблицы.ЭтоПодписьПредседателяКомиссии
			И ДанныеТекущейСтроки <> СтрокаТаблицы Тогда
			
			СтрокаТаблицы.ЭтоПодписьПредседателяКомиссии = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписиКомиссииПриИзменении(Элемент)
	
	Если Объект.ПодписиКомиссии.Количество() = 1 Тогда
		
		Объект.ПодписиКомиссии[0].ЭтоПодписьПредседателяКомиссии = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеДоступностью()
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ГруппаДатаНомерПриказа");
	МассивЭлементов.Добавить("ГруппаЗаголовок");
	МассивЭлементов.Добавить("ГруппаАналитика");
	МассивЭлементов.Добавить("ПодписиКомиссии");
	МассивЭлементов.Добавить("ПериодДействияКомиссии");
	МассивЭлементов.Добавить("ГруппаУтвердил");
	
	КомиссияИспользуетсяВДокументах = Справочники.Комиссии.КомиссияИспользуетсяВДокументах(Объект.Ссылка);
	Для каждого ЭлементаМассива Из МассивЭлементов Цикл
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ЭлементаМассива, "ТолькоПросмотр", КомиссияИспользуетсяВДокументах);
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияПредупреждение", "Видимость", КомиссияИспользуетсяВДокументах);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДублиФизическихЛиц(Отказ)
	
	ТаблицаФизическихЛиц = Объект.ПодписиКомиссии.Выгрузить(, "ПодписьЧленаКомиссии");
	
	ТаблицаФизическихЛиц.Колонки.Добавить("Счетчик", Новый ОписаниеТипов("Число"));
	ТаблицаФизическихЛиц.ЗаполнитьЗначения(1, "Счетчик");
	ТаблицаФизическихЛиц.Свернуть("ПодписьЧленаКомиссии", "Счетчик");
	
	ШаблонСообщения = НСтр("ru ='Физическое лицо %1 добавлено более одного раза в комиссию. Необходимо пересмотреть состав комиссии.'");
	Для каждого СтрокаТаблицы Из ТаблицаФизическихЛиц Цикл
		
		Если СтрокаТаблицы.Счетчик > 1 Тогда
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, СтрокаТаблицы.ПодписьЧленаКомиссии), , , , Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УчетОстатковКонтрагентов

&НаКлиенте
Процедура Подключаемый_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
			
	УправлениеITОтделом8УФКлиент.ВыполнитьОбработчикНачалоВыбора(ЭтаФорма, Объект.Организация, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
		
	УправлениеITОтделом8УФКлиент.ВыполнитьОбработчикАвтоПодбор(ЭтаФорма, 
				"Организация",
				Текст, 
				ДанныеВыбора,
				Ожидание,
				СтандартнаяОбработка);
				
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Очистка(Элемент, СтандартнаяОбработка)	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)	
		
	УправлениеITОтделом8УФКлиент.ВыполнитьОбработчикОбработкаВыбора(ЭтаФорма, 
				"Организация", 
				Объект.Организация,
				Новый ОписаниеОповещения("ПослеОбработкиВыбора", ЭтотОбъект),
				ВыбранноеЗначение,
				СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОбработкиВыбора(Результат, ДополнительныеПараметры) Экспорт
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти
